xnorlogic/PIC16F73_Emulator/PIC16F73EMU.c
#include <stdio.h>
#include <stdlib.h>
#include "PIC16F73.h"

int main()
{	
	
	byte MemLocation[] = {0x00,0x02,0x08,0x0a,0x10,0x20};
	byte NumOfBytes[]  = {0x02,0x04,0x02,0x06,0x08,0x0c};
	byte PhysicMem[]   = {0x05,0x28,0x00,0x34,0x00,0x34,0x10,0x28,0x83,0x16,0x86,0x01,0x83,0x12,0x86,0x01,0x03,0x01,0x00,0x00,0x10,0x28,0x03,0x01,0x01,0x30,0x86,0x00,0x86,0x07,0x00,0x00,0x13,0x28};
	
	byte COUNTER = 0;
	
	Memalloc_DLL();
	InitializeReg_DLL();
	
	for(int cycle=0;cycle<sizeof(MemLocation);cycle++){
		for (int aloc =0;aloc<NumOfBytes[cycle];aloc++){
			
			PIC16F73.Program_Physical_Memory[MemLocation[cycle] + aloc] = PhysicMem[COUNTER];
			COUNTER++;
			
		}
	}

	for(int cycle=0;cycle<sizeof(MemLocation);cycle++){
		//Load_ProgramMEM_DLL(<word: Memory address of program memory>, <byte: physical Memory address of program>, <byte: number of bytes>)
		Load_ProgramMEM_DLL(MemLocation[cycle]/2, MemLocation[cycle], NumOfBytes[cycle]);
	}
		
	//Load the PC couter----------------------------------------------
	PIC16F73.PC = (RegisterRead(&PIC16F73, &PCLATH, PCLATH_REG) * 1000) + RegisterRead(&PIC16F73, &PCL, PCL_REG);
	
	//Emulation Core--------------------------------------------------
	while(RegisterRead(&PIC16F73, &PORTB, PORTB_REG)<0xff){
	
		EmulatorCore_DLL();
		
		printf("PortB    = %x\n",RegisterRead(&PIC16F73, &PORTB, PORTB_REG));
		
		/*
		printf("\n");
		printf("f   = 0x%02x\n",PIC16F73.Data_Memory[Data_Memory_Address(&PIC16F73,&STATUS)]);
		printf("W   = 0x%02x\n",PIC16F73.W);
		printf("C   = %x\n",STATUS.BIT_0);
		printf("DC  = %x\n",STATUS.BIT_1);
		printf("Z   = %x\n",STATUS.BIT_2);
		printf("************************");
		*/
	
	}
	//------------------------------------------------------------------
	
	printf("\n---Registry summary---\n");
	//Using export function for PotB
	printf("PortB     = %x\n",PORT_B_REG_Access());
	
	printf("STATUS    = %x\n",RegisterRead(&PIC16F73, &STATUS, STATUS_REG));
	printf("PCL       = %x\n",RegisterRead(&PIC16F73, &PCL, PCL_REG));
	printf("PCLATH    = %x\n",RegisterRead(&PIC16F73, &PCLATH, PCLATH_REG));
	
	//Free memory for cleanup
	Memcleanup_DLL();
	
	return 0;
}
